#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
int main(){
	//char a = 3;//存储  00000011
	//char b = 127;//01111111
	//char c = a + b;   比较 判断相等 加减运算 
	//整形提升  cpu运算使用整形（32bit位）  截断 最高位以符号位补齐
	//printf("c=%d\n", c);
	//00000000000000000000000000000011
	//00000000000000000000000001111111
	//00000000000000000000000010000010
	//c 存     100000010
	//%d   111111111111111111111111111111111111111100000010(补码)
	//     111111111111111111111111111111111111111100000001(反码)
	//     100000000000000000000000000000000000000011111110(原码)
	//截断  11111110（-127）  再次整形提升  %d
	//char a = 0xb6;//10110110
	//short b = 0xb600;
	//int c = 0xb6000000;
	//if (a == 0xb6)
	//	printf("a");
	//if (b == 0xb600)
	//	printf("b");
	//if (c == 0xb6000000)
	//	printf("c");
	//整形提升对象：char short 改变
	//
	//char c = 1;
	//printf("%u\n", sizeof(c));//1
	//printf("%u\n", sizeof(+c));//4 整形提升  int
	//printf("%u\n", sizeof(!c));//1
	//操作符属性：1、操作符的优先级 2、操作符的结合性  3、是否控制求值顺序

	return 0;
}










