#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
int main(){
	//int a = 5;
	//double b = 5.0 / 2;//2
	//int c = a % 2;//1,取模只能使用整数
	//printf("b=%lf\n",b);
	//printf("c=%d\n",c);
	//int a = 16;
	//int b=a >> 1;//右移操作符
	////000000000000000000000000000010000正数 原码 反码 补码 三码相同  负数 储存用补码 输出用原码 此时b=8
	//printf("b=%d\n", b);
	//解读-1
	//int a = -1;//二进制位100000000000000000000000000000000000000000001
	////111111111111111111111111111111111111111110
	////111111111111111111111111111111111111111111对补码进行移位
	//int b = a << 1;//111111111111111111111111111111111111111111111110   111111111111111111111111111111111111101  10000000000000000000000000000000010(-2)
	//printf("b=%d\n",b);
	//int q = 5;
	////000000000000000000000000000000000000000000000101
	//int a = q << 1;//0000000000000000000000000000000000001010
	//	printf("a=%d\n", a);
	//int a = 5;//101
	//int b = 3;//011
	//int c = a&b;//001  1
	//	int d = a | b;//111  7
	//	int f = a^b; //110  6
	//	printf("c=%d\n", c);
	//	printf("d=%d\n",d );
	//	printf("f=%d\n",f );
	//交换两个数的三种方法
	//int a = 3;//011
	//int b = 5;//101
	//printf("before:a=%d b=%d\n", a, b);
	///*int temp = 0;*/
	///*temp = a;
	//a = b;
	//b = temp;*/
	///*a = a + b;
	//b = a - b;
	//a = a - b;*///可能出现溢出的情况
	//a = a^b;//110
	//b = a^b;//101  011 实现a ,b交换
	//a = a^b;110  011  101实现ab 交换
	//printf("after:a=%d b=%d\n",a,b);

	//求一个数中储存在内存中的二进制中1的个数
	//对于整数 选择循环取模的思想%
	//int num = 0;//5  101 5%2=1   5/2=2  
	//int count = 0;//实现计数器
	//scanf("%d", &num);
	//while (num){
	//	if (num % 2 == 1){
	//		count++;
	//	}num = num / 2;//换位

	//}
	//printf("count=%d\n", count);
	//对于一切整数
	//int num = 0;//5 101|001  101 不改变二进制位的数 
	//int count = 0;
	//scanf("%d", &num);
	//int i = 0;
	//for (i = 0; i < 32; i++){//按位或 有1则1
	//	if (1==num>>i|1)
	//		
	//		count++;//统计1的个数
	//	

	//}
	//	printf("count=%d\n", count);

	return 0;
}